# Taps
# tap "homebrew/homebrew-cask"
# tap "homebrew/homebrew-core"

# CLI tools
brew "git"
brew "neovim"
brew "tmux"
brew "zsh"
brew "stow"  # For managing symlinks
brew "ripgrep"  # For neovim searching
brew "fzf"  # Fuzzy finder
brew "bat"  # Better cat
brew "node"
brew "pnpm"
brew "go"
brew "tree"

# Window management
tap "koekeishiya/formulae"
brew "yabai"
brew "skhd"      # Simple hotkey daemon for macOS
cask "karabiner-elements"
 
# Terminal
cask "iterm2"

# Fonts
cask "font-hack-nerd-font"  # Good developer font with icons

# Add any other applications you use regularly
# cask "visual-studio-code"
cask "docker"
